Repository: Vevida/vevida-optimizer
Catalog: languages/vevida-optimizer-*.po
Languages: de_de

source: Convert MySQL MyISAM tables to InnoDB
de_de: MySQL MyISAM-Tabellen zu InnoDB konvertieren

source: This plugin will convert your old MyISAM MySQL database tables to the InnoDB storage engine.
de_de: Das Plugin konvertiert deine alten MyISAM MySQL-Datenbanktabellen in das InnoDB Speichersubsystem.

source: In the earlier days of MySQL, the default storage engine for your database was MyISAM. This is why you still encounter a lot of examples with <code>engine=MyISAM</code> online. Nowadays, the InnoDB storage engine is MySQL's default. MyISAM is no longer actively developed, InnoDB is. Therefore, most
de_de: In den frühen Tagen von MySQL war das Standard-Speichersubsystem für deine Datenbank MyISAM. Darum findest du online immer noch viele Beispiele mit <code>engine=MyISAM</code>. Heutzutage ist das InnoDB Speichersubsystem der Standard bei MySQL. MyISAM wird nicht mehr weiterentwickelt, InnoDB dagegen schon. Deshalb sind viele

source: MySQL performance optimizations
de_de: MySQL-Performanceoptimierungen

source: are for the InnoDB engine and it's wise to choose this as your table storage engine.
de_de: für das InnoDB Speichersubsystem und es ist sinnvoll dies als Speichersubsystem für deine Tabellen zu wählen.

source: Please note, the performance gain depends on your web hosting company's MySQL server configuration. Contact your hosting provider for more information about the specific MySQL (InnoDB storage engine) set up. If you want to know more about this conversion process, see my blog post on how to
de_de: Bitte beachte, dass der Performancegewinn von der Konfiguration des MySQL-Servers deines Anbieters abhängig ist. Kontaktiere deinen Anbieter für weitere Informationen zur spezifischen Konfiguration von MySQL (InnoDB Speichersubsystem). Wenn du mehr zu dem Konvertierungsprozess wissen möchtest, schau dir meinen Beitrag an, wie man

source: convert MySQL MyISAM tables to InnoDB
de_de: MySQL MyISAM-Tabellen zu InnoDB konvertiert

source: and how to
de_de: und wie man

source: optimize all MySQL tables with MySQLi multi_query
de_de: alle MySQL-Tabellen mit MySQLi multi_query optimiert

source: The plugin tries to be as gentle as possible, however, you use this plugin at your own risk!
de_de: Das Plugin versucht so behutsam wie möglich zu sein, dennoch benutzt du das Plugin auf eigene Gefahr!

source: As a bonus, the plugin optimizes the WordPress <code>wp_options</code> table with an index on the autoload column too. More on that
de_de: Als Bonus optimiert das Plugin auch die WordPress <code>wp_options</code> Tabelle mit einem Index für die autoload Spalte. Mehr dazu

source: here
de_de: hier

source: Convert my MySQL tables
de_de: Meine MySQL-Tabellen konvertieren

source: Whoops, error!
de_de: Whoops, Fehler!

source: Turns out something went wrong... Please check your PHP error log file.
de_de: Es ist etwas schief gegangen… Bitte prüfe deine PHP-Fehlerprotokolldatei.

source: Database convert complete!
de_de: Die Datenbankkonvertierung war erfolgreich!

source: Either your database tables were already created with the InnoDB storage engine, or the convert process is completed successfully.
de_de: Entweder wurden deine Datenbanktabellen bereits mit dem InnoDB Speichersubsystem erstellt oder der Konvertierungsprozess bereits erfolgreich abgeschlossen.

source: Optimize MySQL tables
de_de: MySQL-Tabellen optimieren

source: Keeping your WordPress database optimized is <em>a must</em> for a well performing WordPress website. Your plugin authors over at
de_de: Die WordPress-Datenbank in Schuss zu halten ist <em>ein Muss</em> für eine performante WordPress-Website. Deine Plugin-Autoren von

source: care about your site performance.
de_de: sorgen für die Performance deiner Seite vor.

source: Every WordPress post, draft, revision and comment adds data to your MySQL database, and removing revisions, drafts and comments creates empty space between data. This makes your database bigger and more fragmented. Defragmenting the data puts all data back in order and removes empty space. This results in a smaller database. The defragmented database performs faster because MySQL will be able to locate information much faster.
de_de: Jeder WordPress Beitrag, Entwurf, Revision und Kommentar fügt Daten zu deiner MySQL-Datenbank hinzu und das Entfernen von Revisionen, Entwürfen und Kommentaren hinterlässt Leerräume zwischen den Daten. Das macht deine Datenbank größer und fragmentierter. Das Defragmentieren der Daten bringt alle Daten wieder in die richtige Reihenfolge und entfernt die Leerräume. Dadurch wird die Datenbank kleiner. Die defragmentierte Datenbank performt viel schneller, da MySQL die Informationen viel schneller lokalisieren kann.

source: Pressing the button below performs an MySQL optimization by executing an <code>OPTIMIZE TABLE</code> statement on all WordPress MySQL tables. All other, non-WordPress tables remain untouched.
de_de: Das Klicken des unten stehenden Buttons führt eine MySQL-Optimierung durch, die den Befehl <code>OPTIMIZE TABLE</code> bei allen MySQL-Tabellen von WordPress ausführt. Alle anderen Tabellen, die nicht zu WordPress gehören, bleiben davon unverändert.

source: Optimize MySQL database tables
de_de: MySQL-Datenbanktabellen optimieren

source: Turns out DB optimization went wrong... Please check your PHP error log file.
de_de: Die Datenbankoptimierung ist schief gegangen… Bitte prüfe deine PHP-Fehlerprotokolldatei.

source: MySQL database optimization successful!
de_de: Die MySQL-Datenbankoptimierung war erfolgreich!

source: You MySQL database tables were successfully optimized!
de_de: Deine MySQL-Datenbanktabellen wurden erfolgreich optimiert!

source: Update Settings
de_de: Einstellungen Aktualisierungen

source: Convert MyISAM to InnoDB
de_de: MyISAM zu InnoDB konvertieren

source: Automatic update settings
de_de: Einstellungen für automatische Aktualisierungen

source: It is possible to disable the different kinds of automatic updates. Also, updates for specific plugins can be disabled. Only use this option when automatically updating a plugin is not possible or problematic.
de_de: Es ist möglich, die unterschiedlichen Arten der automatischen Aktualisierungen zu deaktivieren. Zudem können die Aktualisierungen für bestimmte Plugins deaktiviert werden. Benutze diese Option nur, wenn das automatische Aktualisieren eines Plugins nicht möglich oder problematisch ist.

source: Enable or disable automatic updates
de_de: Automatische Aktualisierungen aktivieren oder deaktivieren

source: Update to new major version
de_de: Hauptversionen aktualisieren

source: e.g. WordPress 4.4 to 4.5
de_de: z.B. WordPress 4.4 auf 4.5

source: Update to new minor version
de_de: Nebenversionen aktualisieren

source: e.g. WordPress 4.4.1 to 4.4.2
de_de: z.B. WordPress 4.4.1 auf 4.4.2

source: Update themes
de_de: Themes aktualisieren

source: Update Translations
de_de: Übersetzungen aktualisieren

source: Enable or disable plugin updates
de_de: Automatische Plugin-Aktualisierungen aktivieren oder deaktivieren

source: Send email notifications
de_de: E-Mail-Benachrichtigungen versenden

source: Enable notifications
de_de: Benachrichtigungen aktivieren

source: All updates are enabled by default. Only change this if your website experiences issues after an automatic update. In that case, resolve the issue that blocks the automatic update process, and reenable automatic updates.
de_de: Alle Aktualisierungen sind standardmäßig aktiviert. Ändere dies nur, wenn deine Website nach einer automatischen Aktualisierung Probleme verzeichnet. Löse in diesem Fall das Problem, das den automatischen Aktualisierungsprozess blockiert, und aktiviere die automatischen Aktualisierungen wieder.

source: Some plugins require a different update method. Or the plugin simpy breaks as a result of the update. In that case automatic updates for the plugin can be (temporarily) disabled.
de_de: Manche Plugins benötigen eine andere Maßnahme zur Aktualisierung. Oder das Plugin geht aufgrund der Aktualisierung einfach kaputt. In diesem Fall können automatische Aktualisierungen (temporär) deaktiviert werden.

source: An email can be sent after each automatic update to notify the site admin (
de_de: Eine E-Mail kann nach jeder automatischen Aktualisierung an den Administrator der Seite versendet werden (

source: ) of the update. This can be useful in troubleshooting the site after an automatic update.
de_de: ). Dies kann bei der Fehlerbehebung nach einer automatischen Aktualisierung nützlich sein.

source: Settings
de_de: Einstellungen

source: Configure automatic updates for each WordPress component, and optimize the mySQL database tables.
de_de: Konfiguriere die automatischen Updates für jede Komponente in WordPress und optimiere die MySQL-Datenbanktabellen.
